Revision of all pandas concept learned

In [3]:
import pandas as pd

In [4]:
# Create your own data frame
students = {
    'id' : [1,2,3,4,5,6],
    'first' : ['Rabin', 'Sabin', 'Prabin', 'Harbin', 'Damin', 'Ramin'],
    'last' : ['Karki', 'Sarki', 'Tharki', 'Darki', 'Narki', 'Parki'],
    'email': ['rabinkarki11@gmail.com', 'sabinsarki234@gmail.com', 'tharkiprabin345@gmail.com', 
                'darkiharbin456@gmail.com', 'narkidamin789@gmail.com', 'raminparki348@gmail.com'],
    'GPA' : [3.44, 3.89, 2.90, 4.00, 3.19, 4.00]
}
df = pd.DataFrame(students)
df

   id   first    last                      email   GPA
0   1   Rabin   Karki     rabinkarki11@gmail.com  3.44
1   2   Sabin   Sarki    sabinsarki234@gmail.com  3.89
2   3  Prabin  Tharki  tharkiprabin345@gmail.com  2.90
3   4  Harbin   Darki   darkiharbin456@gmail.com  4.00
4   5   Damin   Narki    narkidamin789@gmail.com  3.19
5   6   Ramin   Parki    raminparki348@gmail.com  4.00

In [5]:
df.columns

Index(['id', 'first', 'last', 'email', 'GPA'], dtype='object')

In [6]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [7]:
df.head()

   id   first    last                      email   GPA
0   1   Rabin   Karki     rabinkarki11@gmail.com  3.44
1   2   Sabin   Sarki    sabinsarki234@gmail.com  3.89
2   3  Prabin  Tharki  tharkiprabin345@gmail.com  2.90
3   4  Harbin   Darki   darkiharbin456@gmail.com  4.00
4   5   Damin   Narki    narkidamin789@gmail.com  3.19

In [8]:
df.tail()

   id   first    last                      email   GPA
1   2   Sabin   Sarki    sabinsarki234@gmail.com  3.89
2   3  Prabin  Tharki  tharkiprabin345@gmail.com  2.90
3   4  Harbin   Darki   darkiharbin456@gmail.com  4.00
4   5   Damin   Narki    narkidamin789@gmail.com  3.19
5   6   Ramin   Parki    raminparki348@gmail.com  4.00

In [9]:
df.shape # size of the dataframe

(6, 5)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      6 non-null      int64
 1   first   6 non-null      object
 2   last    6 non-null      object
 3   email   6 non-null      object
 4   GPA     6 non-null      float64
dtypes: float64(1), int64(1), object(3)
memory usage: 368.0+ bytes

In [11]:
df.describe()

             id       GPA
count  6.000000  6.000000
mean   3.500000  3.570000
std    1.870829  0.465274
min    1.000000  2.900000
25%    2.250000  3.252500
50%    3.500000  3.665000
75%    4.750000  3.972500
max    6.000000  4.000000

Lesson two revision

In [12]:
df['first'] # Accessing a column

0     Rabin
1     Sabin
2    Prabin
3    Harbin
4     Damin
5     Ramin
Name: first, dtype: object

In [17]:
df.email

0       rabinkarki11@gmail.com
1      sabinsarki234@gmail.com
2    tharkiprabin345@gmail.com
3     darkiharbin456@gmail.com
4      narkidamin789@gmail.com
5      raminparki348@gmail.com
Name: email, dtype: object

In [18]:
df[['last', 'first']]

     last   first
0   Karki   Rabin
1   Sarki   Sabin
2  Tharki  Prabin
3   Darki  Harbin
4   Narki   Damin
5   Parki   Ramin

In [19]:
type(df[['last', 'first']])

pandas.core.frame.DataFrame

In [20]:
df.columns

Index(['id', 'first', 'last', 'email', 'GPA'], dtype='object')

In [ ]:
df.iloc[0] # first row

id                            1
first                     Rabin
last                      Karki
email    rabinkarki11@gmail.com
GPA                        3.44
Name: 0, dtype: object